Repository: KUD-00/tollcat
Catalog: CLI/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja

source: 本月至今
en: Month to date
ja: 今月の累計

source: 预计月底
en: Projected
ja: 月末見込み

source: 还没有接入任何服务。
en: No services connected.
ja: 接続しているサービスはない。

source: 用法：
en: Usage:
ja: 使い方：

source: 用法: tollcat 本月合计 tollcat --oneline 一行，给状态栏 tollcat --json 机器可读 tollcat add <服务> 写入凭据 tollcat remove <服务> 移除 tollcat refresh 强制拉新 tollcat providers 支持的服务 tollcat --version 旗标: --no-color 关闭颜色（也认 NO_COLOR） --locale <tag> 覆盖 LANG --max-age <分钟> 账本缓存时长，默认 30，0 表示总是拉新
en: Usage: tollcat this month's total tollcat --oneline one line, for a status bar tollcat --json machine-readable tollcat add <service> save credentials tollcat remove <service> tollcat refresh fetch now tollcat providers supported services tollcat --version Flags: --no-color no color (also honors NO_COLOR) --locale <tag> override LANG --max-age <minutes> ledger cache, default 30, 0 = always fetch
ja: 使い方: tollcat 今月の合計 tollcat --oneline 1行。ステータスバー用 tollcat --json 機械可読 tollcat add <サービス> 認証情報を保存 tollcat remove <サービス> tollcat refresh 今すぐ取得 tollcat providers 対応サービス tollcat --version フラグ: --no-color 色を消す（NO_COLOR も見る） --locale <tag> LANG を上書き --max-age <分> 台帳キャッシュ。既定 30。0 で毎回取得

source: 未知服务：%@
en: Unknown service: %@
ja: 未知のサービス：%@

source: 这家服务不接入。
en: This service isn't supported.
ja: このサービスは対象外。

source: CLI 读不了这家：没有公开的账单接口。
en: The CLI can't read this one: no public billing API.
ja: CLI では読めない。公開の請求 API がない。

source: 教程：%@
en: Guide: %@
ja: 手順：%@

source: 要花钱取数，默认刷新会跳过。接入测试仍会打一次。
en: This one costs money to refresh, so the default refresh skips it. A connection test still hits the API once.
ja: 取得にお金がかかるので、通常の更新では飛ばす。接続テストでは一度だけ打つ。

source: 已接入 %@。
en: Connected %@.
ja: %@ を接続した。

source: 已移除 %@。
en: Removed %@.
ja: %@ を削除した。

source: 部分刷新失败。
en: Some refreshes failed.
ja: 一部の更新に失敗した。

source: 未知旗标：%@
en: Unknown flag: %@
ja: 未知のフラグ：%@

source: 未知命令：%@
en: Unknown command: %@
ja: 未知のコマンド：%@

source: 用法错误。
en: Usage error.
ja: 使い方が違う。

source: 非交互环境请设置环境变量 TOLLCAT_<服务>_<字段>。
en: In a non-interactive session, set TOLLCAT_<SERVICE>_<FIELD>.
ja: 対話できない環境では、環境変数 TOLLCAT_<サービス>_<フィールド> を設定して。

source: 缺必填字段：%@
en: Missing required field: %@
ja: 必須項目が足りない：%@

source: 取数失败：%@
en: Fetch failed: %@
ja: 取得に失敗：%@

source: 没有接入 %@。
en: %@ isn't connected.
ja: %@ は接続されていない。

source: %@ ↗ 预计 %@
en: %@ ↗ projected %@
ja: %@ ↗ 見込み %@

source: %@ ↘ 预计 %@
en: %@ ↘ projected %@
ja: %@ ↘ 見込み %@

source: %@ · 预计 %@
en: %@ · projected %@
ja: %@ · 見込み %@

source: Secret Service 不可用。凭据请用环境变量 TOLLCAT_<服务>_<字段>。
en: Secret Service isn't available. Set credentials with TOLLCAT_<SERVICE>_<FIELD>.
ja: Secret Service が使えない。認証情報は環境変数 TOLLCAT_<サービス>_<フィールド> で渡して。
